{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "trainable": true, "dim_ordering": "th", "nb_col": 7, "subsample": [4, 1], "init": "he_normal", "bias": true, "nb_filter": 350, "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 1, 4, 500], "W_regularizer": {"l2": 9.999999974752427e-07, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 4}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "trainable": true, "dim_ordering": "th", "nb_col": 7, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 350, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 9.999999974752427e-07, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "trainable": true, "dim_ordering": "th", "nb_col": 7, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 350, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 9.999999974752427e-07, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_3"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "trainable": true, "dim_ordering": "th", "nb_col": 7, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 350, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 9.999999974752427e-07, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_4"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "trainable": true, "dim_ordering": "th", "nb_col": 7, "subsample": [1, 1], "init": "he_normal", "bias": true, "nb_filter": 350, "border_mode": "valid", "b_regularizer": null, "W_regularizer": {"l2": 9.999999974752427e-07, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_5"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "th", "pool_size": [1, 26], "strides": [1, 26], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": 6300, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "output_dim": 300}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_normal", "bias": true, "input_dim": 300, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_7"}}]}